In [1]:
import pandas as pd
df = pd.read_csv("Bank Customer Churn Prediction.csv")

In [2]:
df

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,15606229,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,15569892,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,15584532,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,15682355,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,15628319,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [3]:
df.isna().sum()

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

In [4]:
df['churn'].value_counts()

churn
0    7963
1    2037
Name: count, dtype: int64

In [5]:
df.dtypes

customer_id           int64
credit_score          int64
country              object
gender               object
age                   int64
tenure                int64
balance             float64
products_number       int64
credit_card           int64
active_member         int64
estimated_salary    float64
churn                 int64
dtype: object

In [6]:
df['country'].value_counts()

country
France     5014
Germany    2509
Spain      2477
Name: count, dtype: int64

In [7]:
df['gender'].value_counts()

gender
Male      5457
Female    4543
Name: count, dtype: int64

In [8]:
df.drop('customer_id',axis=1,inplace=True)

In [9]:
df

,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...
9995,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [10]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder(drop='first')
encoded_data = encoder.fit_transform(df[['gender', 'country']])
encoded_columns = encoder.get_feature_names_out()
encoded_df = pd.DataFrame(encoded_data.toarray(), columns=encoded_columns)
df_enc = pd.concat([df.drop(['gender', 'country'], axis=1), encoded_df], axis=1)

In [11]:
df_enc

,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,gender_Male,country_Germany,country_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0.0,0.0,0.0
1,608,41,1,83807.86,1,0,1,112542.58,0,0.0,0.0,1.0
2,502,42,8,159660.80,3,1,0,113931.57,1,0.0,0.0,0.0
3,699,39,1,0.00,2,0,0,93826.63,0,0.0,0.0,0.0
4,850,43,2,125510.82,1,1,1,79084.10,0,0.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64,0,1.0,0.0,0.0
9996,516,35,10,57369.61,1,1,1,101699.77,0,1.0,0.0,0.0
9997,709,36,7,0.00,1,0,1,42085.58,1,0.0,0.0,0.0
9998,772,42,3,75075.31,2,1,0,92888.52,1,1.0,1.0,0.0
9999,792,28,4,130142.79,1,1,0,38190.78,0,0.0,0.0,0.0

In [12]:
x = df_enc.drop('churn',axis=1)
y = df_enc['churn']

In [13]:
from sklearn.preprocessing import StandardScaler
scl = StandardScaler()
scl.fit(x)
x_scl = scl.transform(x)

In [14]:
pip install imblearn -q

Note: you may need to restart the kernel to use updated packages.

In [15]:
from imblearn.over_sampling import SMOTE
smote = SMOTE()
X_resampled, y_resampled = smote.fit_resample(x_scl, y)

In [16]:
X_resampled.shape

(15926, 11)

In [17]:
y_resampled.value_counts()

churn
1    7963
0    7963
Name: count, dtype: int64

In [18]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X_resampled,y_resampled,shuffle=True)

In [19]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

In [20]:
clf = DecisionTreeClassifier()
clf.fit(x_train,y_train)
train_preds = clf.predict(x_train)
test_preds = clf.predict(x_test)
print('Train acc: ',accuracy_score(train_preds,y_train))
print('Test acc: ',accuracy_score(test_preds,y_test))

Train acc:  1.0
Test acc:  0.8304871923656454

In [21]:
clf.get_depth()

26

In [22]:
clf = DecisionTreeClassifier(max_depth=15)
clf.fit(x_train,y_train)
train_preds = clf.predict(x_train)
test_preds = clf.predict(x_test)
print('Train acc: ',accuracy_score(train_preds,y_train))
print('Test acc: ',accuracy_score(test_preds,y_test))

Train acc:  0.9472538513060951
Test acc:  0.8189352084379709

In [23]:
from sklearn.linear_model import LogisticRegression
clf = LogisticRegression(C=10)
clf.fit(x_train,y_train)
train_preds = clf.predict(x_train)
test_preds = clf.predict(x_test)
print('Train acc: ',accuracy_score(train_preds,y_train))
print('Test acc: ',accuracy_score(test_preds,y_test))

Train acc:  0.7092263898191561
Test acc:  0.7197388247112004

In [38]:
from sklearn.ensemble import GradientBoostingClassifier
clf = GradientBoostingClassifier(max_depth=6)
clf.fit(x_train,y_train)
train_preds = clf.predict(x_train)
test_preds = clf.predict(x_test)
print('Train acc: ',accuracy_score(train_preds,y_train))
print('Test acc: ',accuracy_score(test_preds,y_test))

Train acc:  0.9382116543871399
Test acc:  0.8962832747363134

In [25]:
from langchain_google_genai import ChatGoogleGenerativeAI
google_api_key = "AIzaSyDCvYe_Gc_7uAQw-OQHZZmL52bPT67MKbM"
llm = ChatGoogleGenerativeAI(model="gemini-pro",google_api_key=google_api_key,temperature=1)

In [26]:
df.dtypes

credit_score          int64
country              object
gender               object
age                   int64
tenure                int64
balance             float64
products_number       int64
credit_card           int64
active_member         int64
estimated_salary    float64
churn                 int64
dtype: object

In [27]:
prompt = """
You are a Bank churn assistant named Zenith Arabia, your job is to take the user question and extract the following information from the user's question

credit_score          int64
country              object
gender               object
age                   int64
tenure                int64
balance             float64
products_number       int64
credit_card           int64
active_member         int64
estimated_salary    float64

Examples:
credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary
619,France,Female,42,2,0.00,1,1,1,101348.88
608,Spain,Female,41,1,83807.86,1,0,1,112542.58
502,France,Female,42,8,159660.80,3,1,0,113931.57
699,France,Female,39,1,0.00,2,0,0,93826.63
850,Spain,Female,43,2,125510.82,1,1,1,79084.10


Note:
    - The output must be in csv format that is able to be converted to dataframe if all information are presented
    - the output must be in the format as the given examples
    - return the csv format only without any additional text
    - if any of the values are not presented in the question 
        1. do not return the csv format, just return a normal sentence
        2. apologies to the user and tell him a good sentence about the missing information

example for the output if all information are presented:
credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary
619,France,Female,42,2,0.00,1,1,1,101348.88
----------------------
credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary
850,Spain,Female,43,2,125510.82,1,1,1,79084.10

Question: {user_input}
"""

from langchain.prompts import PromptTemplate

Prompt_Template = PromptTemplate(
    input_variables=["user_input"],
    template=prompt
)

In [52]:
import pandas as pd
from io import StringIO

In [53]:
df.head()

,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [54]:
question = """
a 42 years old female client from france with credit score of 502 with tenure of 8, balance 159000 who bought 3 product number. 
the client is not active and has a credit card, its estimated salary is 10k per month

"""

In [55]:
prompt_filled_by_question =Prompt_Template.format(
        user_input = question,
        )
res = llm.invoke(prompt_filled_by_question).content
print(res)

credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary
502,France,Female,42,8,159000.00,3,1,0,10000

In [56]:
data_io = StringIO(res)
df_sample = pd.read_csv(data_io)
if df_sample.empty:
    print(res)
else:
    encoded_data = encoder.transform(df_sample[['gender', 'country']])
    encoded_columns = encoder.get_feature_names_out()
    encoded_df = pd.DataFrame(encoded_data.toarray(), columns=encoded_columns)
    df_enc = pd.concat([df_sample.drop(['gender', 'country'], axis=1), encoded_df], axis=1)
    data_scl = scl.transform(df_enc)
    prediction = clf.predict(data_scl)
    if prediction[0] == 0:
        print('The customer will not exit (0)')
    else:
        print('The customer will exit (1)')

The customer will exit (1)

In [35]:
data_scl

array([[-0.32622142, -0.37395771, -1.04175968, -1.22584767, -0.91158349,
         0.64609167,  0.97024255, -1.56657925, -1.09598752, -0.57873591,
        -0.57380915]])

In [57]:
import pickle
with open('clf.pkl', 'wb') as file:
    pickle.dump(clf, file)
with open('scl.pkl', 'wb') as file:
    pickle.dump(scl, file)
with open('encoder.pkl', 'wb') as file:
    pickle.dump(encoder, file)